Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-43-53.tmx
Source language: bo
Languages: en

source: །ཕྱོགས་བཅུར་ཡང་སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་བ་བསམ་གྱིས་མི་ཁྱབ་པ་ཡོངས་སུ་བསྟན་པ་དེས་སེམས་ཅན་གྱི་ཁམས་མཐའ་དང་དབུས་མེད་པ་ཐེག་པ་གསུམ་གྱིས་དུལ་བར་གྱུར་ཏོ།
en: Also, the manifestation of inconceivable buddha miracles in the ten directions guided a vast extent of beings, without end or middle, by means of the three yānas.

source: །དེ་ནས་རྒྱལ་པོ་ནོར་གྱི་བདག་པོ་ཆོས་ཀྱི་སྣང་བ་རབ་ཏུ་ཐོབ་པ། དེའི་ཡིད་ལ་འདི་སྙམ་སྟེ། ཁྱིམ་ན་གནས་པས་ནི་རྣམ་པ་འདི་ལྟ་བུའི་ཆོས་ཀྱང་ཁོང་དུ་ཆུད་པར་མི་ནུས་ལ་ཡེ་ཤེས་རྣམ་པ་འདི་ལྟ་བུ་ཡང་བསྒྲུབས་པར་མི་ནུས་ཀྱིས་བདག་ནི་བཅོམ་ལྡན་འདས་ཀྱི་ཞམ་རིང་དུ་རབ་ཏུ་འབྱུང་ངོ་སྙམ་ནས། རྒྱལ་པོ་ནོར་གྱི་བདག་པོས། བཅོམ་ལྡན་འདས་དེ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: “Then King Dhanapati, who had attained the illumination of the Dharma, thought, ‘Living in a home, I will not be able to comprehend such a Dharma as this and will not be able to accomplish this kind of wisdom. I will enter homelessness as a servant of this bhagavat.’

source: །བཅོམ་ལྡན་འདས་བདག་བཅོམ་ལྡན་འདས་ཀྱི་ཞམ་རིང་དུ་རབ་ཏུ་འབྱུང་ཞིང་བསྙེན་པར་རྫོགས་པའི་དགེ་སློང་གི་ཚུལ་ལ་མཆིས་པར་ཅི་གནང་ཞེས་ནས།
en: “King Dhanapati said to the Bhagavat, ‘Bhagavat, I wish to enter homelessness in the presence of the Bhagavat and enter the way of a complete bhikṣu.’

source: བཅོམ་ལྡན་འདས་དེས་བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་དེའི་དུས་ལ་དབབ་པར་ཤེས་ན་རུང་ངོ་།
en: “The Bhagavat said, ‘Great king, you may consider that the time for that has come.’

source: །དེ་ནས་རྒྱལ་པོ་ནོར་གྱི་བདག་པོ་སྲོག་ཆགས་སྟོང་ཕྲག་བཅུ་དང་ལྷན་ཅིག་ཏུ་དེ་བཞིན་གཤེགས་པ་སྐུ་ཉི་མ་དམ་པའི་ཞམ་རིང་དུ་རབ་ཏུ་བྱུང་ངོ་།
en: “Then King Dhanapati, together with ten thousand beings, entered homelessness in the presence of the Tathāgata Sūrya­gātra­pravara.

source: །དེ་ལྟར་རབ་ཏུ་བྱུང་ནས་རིང་པོ་མ་ལོན་པར་གཟུངས་ཀྱི་སྒོ་ཆོས་ཐམས་ཅད་ལ་རབ་རིབ་མེད་པའི་དོན་གྱི་སྒྲོན་མ་ཞེས་བྱ་བ་དེ་འཁོར་དང་བཅས་པར་ཡོངས་སུ་བསྒྲུབས་སོ། །བསྒོམས་སོ། །ཤིན་ཏུ་བསྒོམས་སོ།
en: Not long after entering homelessness, he accomplished the dhāraṇī gateway called the lamp of the meaning of all the Dharmas freed from darkness and its accompanying dhāraṇī gateways, meditated on them, and meditated on them well.

source: །དེ་སྙེད་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་ཡང་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏོ།
en: He also attained many samādhi gateways.

source: །བྱང་ཆུབ་སེམས་དཔའི་མངོན་པར་ཤེས་པ་བཅུ་ཡང་རབ་ཏུ་ཐོབ་བོ།
en: He also attained the ten higher cognitions of a bodhisattva.

source: །སོ་སོ་ཡང་དག་པར་རིག་པའི་ཚུལ་རྒྱ་མཚོ་ལ་ཡང་དག་པར་ཞུགས་པར་གྱུར་ཏོ།
en: He also entered an ocean of the ways of discernment.

source: །ཕྱོགས་བཅུའི་དེ་བཞིན་གཤེགས་པའི་དྲུང་དུ་འགྲོ་བ་ཐོགས་པ་མེད་པའི་སྤྱོད་ཡུལ་ཞེས་བྱ་བའི་ལུས་ཡོངས་སུ་དག་པ་ཡང་རབ་ཏུ་ཐོབ་སྟེ།
en: He also attained a pure body called the unimpeded field of activity , through which he went without impediment into the presence of the tathāgatas in the ten directions.

source: དེས་བཅོམ་ལྡན་འདས་དེའི་ཆོས་ཀྱི་འཁོར་ལོ་ཡང་དག་པར་བླངས་སོ། །ཡོངས་སུ་བཟུང་ངོ་། །གཏམ་གྱི་སྐྱེས་བུ་ཡང་བྱས་སོ། །ཆོས་སྨྲ་བ་ཆེན་པོ་ཡང་བྱས་སོ།
en: He obtained and held the Dharma wheels of that bhagavat and spoke about them with people, and he became a great dharmabhāṇaka and was a holder of the teaching.

source: །བསྟན་པ་ཡོངས་སུ་གཟུང་བ་ཡང་བྱས་སོ། །མངོན་པར་ཤེས་པ་ཐོབ་པའི་སྟོབས་ཀྱིས་ཀྱང་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་རྒྱས་པར་བཀང་སྟེ། བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་སེམས་ཅན་རྣམས་ལ་ལུས་ཡོངས་སུ་བསྟན་ནས།
en: Through the power of attaining the higher cognitions, he spread throughout all world realms and manifested bodies to beings in accordance with their aspirations.

source: སངས་རྒྱས་བྱུང་བ་དེ་རབ་ཏུ་བརྗོད་པ་དང་། སྔོན་གྱི་དེ་བཞིན་གཤེགས་པས་ཡོངས་སུ་བསྒྲུབ་པའི་ཆོས་ཉིད་མངོན་པར་བརྗོད་པ་དང་། སྔོན་གྱི་སྦྱོར་བ་ཕུན་སུམ་ཚོགས་པ་དེ་དག་ཡོངས་སུ་བརྗོད་པ་དང་། སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པའི་མཐུ་དེ་དག་ཡོངས་སུ་བརྗོད་པར་བྱ་བས་བསྟན་པ་ཡོངས་སུ་གཟུང་བ་བྱས་སོ།
en: He told them about this appearance of a buddha, told them about the nature of the accomplishments of the past tathāgatas, told them about the perfection of their past applications, described the power of the miraculous manifestations of the buddhas, and in that way was a holder of the teaching.

source: །རྒྱལ་པོའི་སྲས་གཟི་བརྗིད་ཀྱི་བདག་པོས་ཀྱང་དེའི་ཉིན་པར་ཟླ་བ་ཉ་སྟེ། རྒྱས་པའི་ཚེ་རིན་པོ་ཆེ་བདུན་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏེ།
en: “Prince Tejodhipati attained the seven precious possessions of a cakravartin on that very day, when the moon became full.

source: དེ་ཁང་བའི་སྟེང་ན་བུད་མེད་ཀྱི་ཚོགས་ཀྱིས་བསྐོར་ཅིང་འདུག་པའི་མདུན་དུ་འཁོར་ལོ་རིན་པོ་ཆེ་ཆེན་པོ་ཤུགས་ལ་ཐོགས་པ་མེད་པ་ཞེས་བྱ་བ་རྩིབས་སྟོང་ཕྲག་བརྒྱ་དང་ལྡན་པ་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ། ལྷ་རྫས་ཀྱི་འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་ལས་གྲུབ་པ། འོད་ཀུན་ཏུ་འབྱུང་བ་རྣམ་པའི་མཆོག་ཐམས་ཅད་དང་ལྡན་བ་བྱུང་བར་གྱུར་ཏོ།
en: When he was on the palace roof encircled by a gathering of women, there appeared before him a great precious wheel called Pratihatavega, which had a hundred thousand spokes, was adorned by all jewels, was made from divine Jambu River gold, was shining, and possessed every supreme feature.

source: །གླང་བོ་རིན་པོ་ཆེ་ཆེན་པོ་རྡོ་རྗེ་རིན་པོ་ཆེའི་རིའི་གཟི་བརྗིད་ཅེས་བྱ་བ་འབྱུང་བར་གྱུར་ཏོ།
en: A great precious elephant called Vajra­ratna­giri­tejas appeared.

source: །རྟ་རིན་པོ་ཆེ་རི་སྔོ་རླུང་གི་ཤུགས་ཤེས་བྱ་བ་བྱུང་བར་གྱུར་ཏོ།
en: A precious horse called Nīla­giryanila­vega appeared.

source: །ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་ཉི་མའི་སྙིང་པོ་འོད་སྤྲིན་རྒྱལ་པོ་ཞེས་བྱ་བ་བྱུང་བར་གྱུར་ཏོ།
en: A great precious jewel called Āditya­garbha­prabha­megha­rāja appeared.

source: །བུ་མོ་དགའ་བའི་འོད་ཀྱི་དཔལ་ཤིན་ཏུ་སྦྱངས་པ་དེ་ཡང་བུད་མེད་རིན་པོ་ཆེར་བྱུང་བར་གྱུར་ཏོ།
en: The girl Sucalita­rati­prabhāsa­śrī appeared as the precious queen.

source: །ཁྱིམ་བདག་རིན་པོ་ཆེ་ནོར་ཀྱི་ཕུང་པོ་མང་པོ་ཞེས་བྱ་བ་བྱུང་བར་གྱུར་ཏོ།
en: A precious householder called Prabhūta­ghana­skandha appeared.

source: །བློན་པོ་རིན་པོ་ཆེ་མིག་དྲི་མ་མེད་པ་ཞེས་བྱ་བ་ཡང་བྱུང་བར་གྱུར་ཏོ།
en: And seventh, a precious minister called Vimala­netra appeared.

source: །དེ་ལྟར་བདུན་ནོ་དེ་དེ་ལྟར་རིན་པོ་ཆེ་བདུན་དང་ལྡན་པའི་རྒྱལ་པོ་འཁོར་ལོས་སྒྱུར་བ་གླིང་བཞི་ལ་དབང་བ་ཆོས་དང་ལྡན་པ། ཆོས་ཀྱི་རྒྱལ་པོ་རྣམ་པར་རྒྱལ་བ་དང་ལྡན་པ་ཡུལ་གྱི་མཐུ་དང་བརྩོན་འགྲུས་སུ་ལྡན་པར་གྱུར་ཏེ།
en: “In that way, he became a cakravartin king, a possessor of the seven jewels, a sovereign over the four continents, a follower of the Dharma, a Dharma king, and a victor, endowed with the power and vigor of an empire.

source: དེ་ལ་བུ་དཔའ་ལ་བརྟུལ་ཕོད་ཅིང་ཡན་ལག་དམ་པའི་གཟུགས་དང་ལྡན་པ་ཕ་རོལ་གྱི་སྡེ་རབ་ཏུ་འཇོམས་པ་སྟོང་ཡོད་པར་གྱུར་ཏེ།
en: “He had a thousand sons who were courageous and heroic, with perfectly formed bodies, who could crush the armies of enemies.

source: དེས་ས་ཆེན་པོ་འདི་སྐྱོན་མེད་པ་དང་། དགྲ་མེད་པ་དང་། གནོད་པ་མེད་པ་དང་། འཚེ་བ་མེད་པ་དང་། སྐྱིད་པ་དང་ཕུན་སུམ་ཚོགས་པ་དང་། བདེ་བ་དང་ལོ་ལེགས་པ་དང་། མདངས་དགའ་བ་དང་། སྐྱེ་བོའི་མི་མང་པོས་ཡོངས་སུ་གང་བ་ཡང་རི་དང་རྒྱ་མཚོའི་མཐས་ཀླས་པར་ཆོས་ཀྱིས་མངོན་པར་བརྒྱན་ཏེ། གནས་པར་བྱས་སོ།
en: “He ruled the great land to the ends of the mountains and oceans, adorning it with the Dharma, and it was free of problems, without enemies, free of harm, without violence, thriving, prosperous, peaceful, with excellent harvests, joyful, and filled with many beings.

source: །དེ་ས་འཛམ་བུའི་གླིང་དེའི་རྒྱལ་པོའི་གནས་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་དག་ཏུ་ཡང་རྒྱལ་པོའི་གནས་རེ་རེར་གཙུག་ལག་ཁང་ལྔ་བརྒྱ་བྱེད་དུ་བཙུད་དེ།
en: “There were eighty-four thousand royal capitals in that Jambudvīpa, and in each royal city five hundred vihāras were established, and all of them had all the best features

source: ཐམས་ཅད་ཀྱང་རྣམ་པའི་མཆོག་ཐམས་ཅད་དང་ལྡན་པ་ཤ་སྟག་གོ །ལོངས་སྤྱོད་དང་ཡོ་བྱད་ཀྱི་རྣམ་པ་ཐམས་ཅད་ཕུན་སུམ་ཚོགས་པ་ཤ་སྟག་གོ །བཟའ་ཤིང་གི་ར་བ་དང་། ཁང་པ་དང་འཆག་ས་དང་། དུས་ཐམས་ཅད་དུ་བདེ་བར་སྤྱད་པའི་ནགས་ཚལ་གྱི་ཕྲེང་བས་རྣམ་པར་བརྒྱན་པ་ཤ་སྟག་གོ །གཙུག་ལག་ཁང་རེ་རེ་ཞིང་ཡང་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་བརྩིགས་པ་ནི་ལྷུན་གྱི་རྒྱ་ཤིན་ཏུ་ཆེ་བར་བྱས་པ་སྟེ།
en: They all had a perfection of all kinds of requisites and pleasures. They all had gardens, buildings, and walkways and were adorned by rows of forests that could be enjoyed at all times.

source: ནང་རིན་པོ་ཆེ་རྣམ་པ་མང་པོས་བརྒྱན་པ། རིན་པོ་ཆེའི་རྒྱལ་པོ་སྣ་ཚོགས་ཀྱིས་རྣམ་པར་སྤྲས་པ་ཤ་སྟག་སྟེ།
en: “In each vihāra was erected a caitya of the Tathāgata as large as a mountain and adorned on the inside with many jewels and beautified by various kings of jewels.

source: རྒྱལ་པོའི་གནས་དེ་ཐམས་ཅད་དུའང་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྐུ་ཉི་མ་དམ་པ་འཁོར་དང་བཅས་པ།
en: “The Tathāgata Sūrya­gātra­pravara and his followers were invited to come to all those royal cities.

source: གྲོང་ཁྱེར་དུ་གཤེགས་པར་བྱ་བའི་ཕྱིར་སྤྱན་དྲངས་སོ། །རྒྱལ་པོའི་གནས་དེ་དག་ཀུན་ཏུ་ཡང་དེ་བཞིན་གཤེགས་པ་དེ་ལ་དེ་བཞིན་གཤེགས་པའི་མཆོད་པ་རྣམ་པ་ཐམས་ཅད་དུ་བསམ་གྱིས་མི་ཁྱབ་པ་མཆོད་དེ།
en: In all those royal cities, inconceivable offerings of every kind worthy of a tathāgata were made to that tathāgata.

source: སངས་རྒྱས་གྲོང་ཁྱེར་དུ་གཤེགས་པའི་ཆོ་འཕྲུལ་དང་། རྣམ་པར་འཕྲུལ་པས་སེམས་ཅན་ཚད་མེད་པའི་དགེ་བའི་རྩ་བ་ཡོངས་སུ་བསྐྱེད་པའི་ཕྱིར་གཤེགས་སུ་གསོལ་ཏོ།
en: He was asked to come because the miraculous manifestations of a buddha’s entry into a town generated roots of merit in beings.

source: །དེར་ཡང་སེམས་ཅན་མ་དད་པའི་སེམས་དང་ལྡན་པ་རྣམས་ནི་དད་པ་ཐོབ་པར་གྱུར་ཏོ།
en: Beings there who had no faith attained faith.

source: །དད་པ་དང་ལྡན་པའི་སེམས་ཅད་རྣམས་ནི་སངས་རྒྱས་མཐོང་བས་དགའ་བའི་ཤུགས་རྣམ་པར་འཕེལ་བར་གྱུར་ཏོ།
en: Beings who had faith had an increased power of joy on seeing the buddha.

source: །དགའ་བའི་ཤུགས་རྣམ་པར་འཕེལ་བའི་སེམས་ཅན་རྣམས་ནི་བྱང་ཆུབ་ཀྱི་བསམ་པ་རྣམ་པར་དག་པ་ཐོབ་པར་གྱུར་ཏོ། །བྱང་ཆུབ་ཀྱི་བསམ་པ་རྣམ་པར་དག་པའི་སེམས་ཅན་རྣམས་ནི་སྙིང་རྗེ་ཆེན་པོའི་སེམས་སྐྱེས་པར་གྱུར་ཏོ།
en: Beings who had an increased power of joy attained the pure aspiration to enlightenment. Beings who had the pure aspiration to enlightenment developed the motivation of great compassion.

source: །སེམས་ཅན་ལ་ཕན་པར་ཞུགས་པའི་སེམས་ཅན་རྣམས་ནི་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་བཙལ་བ་ལ་བརྩོན་པར་གྱུར་ཏོ།
en: Beings who were engaged in benefiting beings became dedicated to seeking all the Dharma of the buddhas.

source: །སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་ཚུལ་གྱི་རྣམ་པ་ལ་མཁས་པའི་སེམས་ཅན་རྣམས་ནི་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་ངེས་པར་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཕྱིར་སེམས་མངོན་པར་གཞོལ་བར་གྱུར་ཏོ། །ཆོས་མཉམ་པ་ཉིད་ལ་ཞུགས་པའི་སེམས་ཅན་རྣམས་ནི་དུས་གསུམ་མཉམ་པ་ཉིད་ལ་འཇུག་པའི་ཕྱིར།
en: Beings who were learned in the ways of the Dharma of the buddhas focused their minds on realizing the nature of all phenomena. Beings who had realized the equality of all phenomena focused their minds on realizing the equality of the three times.

source: སེམས་མངོན་པར་གཞོལ་བར་གྱུར་ཏོ། །དུས་གསུམ་གྱི་ཡེ་ཤེས་སྣང་བ་ཐོབ་པའི་སེམས་ཅན་རྣམས་ནི་སངས་རྒྱས་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་རྣམ་པར་དམྱིགས་པར་བྱ་བའི་དོན་དུ་ཡེ་ཤེས་སྣང་བ་ལ་ཞུགས་པར་གྱུར་ཏོ།
en: Beings who had attained the illumination of the knowledge of the three times entered the light of wisdom in order to perceive the succession of buddhas.

source: །དེ་བཞིན་གཤེགས་པ་སྣ་ཚོགས་རྣམ་པར་དམྱིགས་པར་བྱ་བ་ལ་ཞུགས་པའི་སེམས་ཅན་རྣམས་ནི་འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་བསྡུ་བའི་དོན་དུ་སེམས་ཅན་མངོན་པར་གཞོལ་བར་གྱུར་ཏོ།
en: The beings who had realized the perception of the various tathāgatas focused their minds on gathering all beings.

source: །འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་བསྡུ་བ་ལ་བརྩོན་པའི་སེམས་ཅན་རྣམས་ནི་བྱང་ཆུབ་སེམས་དཔའི་ལམ་རྣམ་པར་དག་པར་བྱ་བའི་ཕྱིར་སྨོན་ལམ་སྐྱེད་པར་གྱུར་ཏོ། །ལམ་གྱི་མཉམ་པ་ཉིད་ལ་ཞུགས་པའི་སེམས་ཅན་རྣམས་ནི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོ་མངོན་པར་བསྒྲུབ་པའི་ཕྱིར་ཡེ་ཤེས་སྣང་བ་སྐྱེད་པར་གྱུར་ཏོ།
en: The beings who were dedicated to gathering beings generated prayers to purify the bodhisattva path. Beings who had realized the equality of the path gave rise to the light of wisdom in order to attain the Dharma wheels of all the buddhas.

source: །ཆོས་རྒྱ་མཚོ་རྣམ་པར་དབྱེ་བ་ལ་མངོན་པར་མོས་པའི་སེམས་ཅན་རྣམས་ནི་ཞིང་གི་དྲ་བ་ཐམས་ཅད་རང་གི་ལུས་ཀྱིས་རྒྱས་པར་གང་བའི་དོན་དུ་སེམས་མངོན་པར་གཞོལ་བར་གྱུར་ཏོ།
en: The beings who had turned toward the aspects of the ocean of the Dharma focused their minds on pervading the entire net of realms with their own bodies.

source: །ཞིང་མཉམ་པ་ཉིད་ལ་ཞུགས་པའི་སེམས་ཅན་རྣམས་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབང་པོ་རྒྱ་མཚོ་ཡོངས་སུ་ཤེས་པར་བྱ་བའི་ཕྱིར་སྨོན་ལམ་འདེབས་པར་གྱུར་ཏོ།
en: The beings who had realized the equality of the realms prayed to know the ocean of the capabilities of beings.

source: །འགྲོ་བ་ཐམས་ཅད་ཀྱི་དབང་པོ་དང་མོས་པ་ཇི་ལྟ་བ་བཞིན་དུ་རྣམ་པར་དཔྱད་པ་ལ་བརྩོན་པའི་སེམས་ཅན་རྣམས་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཕྱིར་བསམ་པ་རྣམ་པར་དག་པར་གྱུར་ཏོ།
en: The beings who were dedicated to analyzing exactly the aspirations and capabilities of beings purified the motivation to realize omniscience.

source: །སེམས་ཅན་རྣམ་པ་དེ་ལྟ་བུ་དག་གི་དོན་རྣམ་པ་དེ་ལྟ་བུ་དེ་དག་འགྲུབ་པར་འགྱུར་བ་མཐོང་ནས། རྒྱལ་པོ་གཟི་བརྗིད་ཀྱི་བདག་པོས་སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་དང་། ཆོ་འཕྲུལ་བསམ་གྱིས་མི་ཁྱབ་པར་བསྟན་པས་སེམས་ཅན་དེ་དག་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བའི་དོན་དུ་རྒྱལ་པོའི་གནས་དེ་དག་ཐམས་ཅད་དུ་དེ་བཞིན་གཤེགས་སྐུ་ཉི་མ་དམ་པ་གཤེགས་སུ་གསོལ་ཏོ།
en: “King Tejodhipati, seeing that beings gained that kind of accomplishment of those kinds of goals, requested the Tathāgata Sūrya­gātra­pravara to come to all those royal cities in order to ripen and guide those beings through his inconceivable manifestations and miracles.

source: །རིགས་ཀྱི་བུ་དེ་ལ་ཇི་སྙམ་དུ་སེམས།
en: “What do you think, noble one?

source: དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོའི་བུ་གཟི་བརྗིད་ཀྱི་བདག་པོ་ཞེས་བྱ་བར་གྱུར་པ་དེ་བཞན་ཞིག་ཡིན་པ་ཙམ་དུ་སེམས་ན་ནི།
en: At that time, in that time, who was Prince Tejodhipati?

source: ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་འདི་ནི་དེའི་ཚེ་དེའི་དུས་ན། རྒྱལ་པོའི་བུ་གཟི་བརྗིད་ཀྱི་བདག་པོ་ཞེས་བྱ་བ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་སྲིད་ལ་དབང་བ་དེ་བཞིན་གཤེགས་པ་སྐུ་ཉི་མ་དམ་པ་ལ་བསྙེན་བཀུར་བྱེད་བྱེད་པ་དེ་ཡིན་ནོ།
en: Do not think that it was anyone else, for at that time, in that time, the Bhagavat, the Tathāgata Śākyamuni was the Prince Tejodhipati who became the sovereign of a cakravartin’s kingdom and honored the Tathāgata Sūrya­gātra­pravara.

source: དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་ནོར་གྱི་བདག་པོ་གཞོན་ནུ་གཟི་བརྗིད་ཀྱི་བདག་པོའི་ཡབ་དུ་གྱུར་པ་དེ་གཞན་ཞིག་ཡིན་པ་ཙམ་དུ་སེམས་ན་ནི་དེ་ལྟར་མི་བལྟ་སྟེ།
en: At that time, in that time, who was King Dhanapati, the father of Prince Tejodhipati?

source: དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་མེ་ཏོག་གི་འོད་ཅེས་བྱ་བ་ནི་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་ནོར་གྱི་བདག་པོ་ཞེས་བྱ་བར་གྱུར་པ་སྟེ།
en: Do not think that it was anyone else, for at that time, in that time, the Tathāgata Ratna­kusuma­prabha was King Dhanapati.

source: ད་ལྟར་ཤར་ཕྱོགས་སུ་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོའི་ཕ་རོལ་གྱི་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་ཆོས་ཀྱི་དབྱིངས་ནམ་མཁའི་གཟུགས་བརྙན་གྱི་སྤྲིན་ཅེས་བྱ་བ་ན། འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྒྱུད་དབུ་མ་དུས་གསུམ་རབ་ཏུ་སྣང་བའི་རིན་པོ་ཆེའི་རྒྱལ་པོ་ཡོངས་སུ་འབྱུང་བའི་དབྱིངས་ཤེས་བྱ་བའི་འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་འོད་ཀྱི་དཀྱིལ་འཁོར་དཔལ་གྱི་སྒྲོན་མ་ཞེས་བྱ་བ་ན། སྙིང་བོ་བྱང་ཆུབ་ཐམས་ཅད་ལ་དབང་བའི་ལུས་རབ་ཏུ་སྣང་བ་ཞེས་བྱ་བར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་སངས་རྒྱས་ཏེ།
en: He is now at a bodhimaṇḍa called Sarva­vaśita­kāya­pratibhāsa in a world realm called Buddha­prabhā­maṇḍala­śrī­pradīpā, which is in a central group of world realms called Tryadhva­pratibhāsa­maṇi­rāja­saṃbhavā, in an ocean of world realms called Dharma­dhātu­gagana­pratibhāsa­megha, which is to the east beyond an ocean of world realms as numerous as the atoms in an ocean of world realms.

source: སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱིས་བསྐོར་ཅིང་ཆོས་སྟོན་ཏོ།
en: There he has attained the highest, complete enlightenment of buddhahood and is teaching the Dharma encircled by an assembly of bodhisattvas as numerous as the atoms in countless buddha realms.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་འོད་ཅེས་བྱ་བ་དེས་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་མཛད་པའི་ཚེ། འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་ཆོས་ཀྱི་དབྱིངས་ནམ་མཁའི་གཟུགས་བརྙན་དུ་སྣང་བའི་སྤྲིན་ཡོངས་སུ་དག་པར་མཛད་དེ།
en: “When the Bhagavat, the Tathāgata Ratna­kusuma­prabha, was previously practicing bodhisattva conduct, he purified the ocean of world realms called Dharma­dhātu­gagana­pratibhāsa­megha.

source: འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་དེར་དེ་བཞིན་གཤེགས་པ་ཇི་སྙེད་ཅིག་བྱུང་བར་གྱུར་པ་དང་། འབྱུང་བ་དང་འབྱུང་བར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་ཀྱང་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་མེ་ཏོག་གི་འོད་དེས་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་མཛད་པའི་ཚེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སྨྱིན་པར་མཛད་པ་ཤ་སྟག་གོ །རིགས་ཀྱི་བུ་དེ་ལ་ཇི་སྙམ་དུ་སེམས།
en: All the tathāgatas who have appeared, are appearing, and will appear in that ocean of world realms were all ripened for the highest, complete enlightenment by the Bhagavat, the Tathāgata Ratna­kusuma­prabha, during his past practice of bodhisattva conduct. “What do you think, noble one?

source: དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོའི་བཙུན་མོ་པད་མོ་དཔལ་གྱི་སྙིང་པོ་འབྱུང་བ་ཞེས་བྱ་བ་བྱུང་སྟེ། གཞོན་ནུ་གཟི་བརྗིད་ཀྱི་བདག་པོའི་ཡུམ་དུ་གྱུར་པ་བུད་མེད་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞིའི་གཙོ་མོར་གྱུར་པ་དེ་གཞན་ཞིག་ཡིན་པ་ཙམ་དུ་སེམས་ན་ནི།
en: At that time, in that time, who was the king’s queen Padma­śrī­garbha­saṃbhavā, the mother of Prince Tejodhipati, preeminent among the eighty-four thousand wives?

source: དེ་ལྟར་མི་བལྟ་སྟེ། རིགས་ཀྱི་བུ་བཅོམ་ལྡན་འདས་ཀྱི་ཡུམ་ལྷ་མོ་སྒྱུ་མ་བྱང་ཆུབ་སེམས་དཔའ་བསྐྱེད་བསྐྱེད་པ་རྣམ་པར་ཐར་པ་ཀུན་ཏུ་སྣང་ཞིང་སྒྲིབ་པ་མེད་པ་ལ་རབ་ཏུ་གནས་པ། སྔོན་དེ་བཞིན་གཤེགས་པས་ཡོངས་སུ་བསྒྲུབས་པ་མངོན་དུ་གྱུར་པ། བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བ་ཐམས་ཅད་ཡོངས་སུ་བསྟན་པའི་ཚུལ་ལ་མཁས་པ་འདི་ནི་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་ནོར་གྱི་བདག་པའི་བཙུན་མོ་དམ་པ་པད་མོ་དཔལ་གྱི་སྙིང་པོ་འབྱུང་བ་ཞེས་བྱ་བར་གྱུར་ཏོ།
en: Do not think that it was anyone else, noble one, for at that time, in that time, Māyādevī, the mother of the Bhagavat, who gave birth to the bodhisattva, who is established in the liberation of unobscured, complete illumination, who has directly perceived the accomplishments of tathāgatas in the past, who knows the visions of the births of all bodhisattvas, was King Dhanapati’s preeminent queen, Padma­śrī­garbha­saṃbhavā.

source: དེའི་ཚེ་དེའི་དུས་ན་སྤྲུལ་འཚོང་མའི་གཙོ་མོ་བལྟ་ན་སྡུག་པ་ཞེས་བྱ་བ་བྱུང་བ་དེ་གཞན་ཞིག་ཡིན་པ་ཙམ་དུ་སེམས་ན་ནི་དེ་ལྟར་མི་བལྟ་སྟེ།
en: At that time, in that time, who was Sudarśanā, the preeminent courtesan?

source: ཤཱཀྱ་ལག་ན་ཁར་པའི་ཆུང་མ་ཁོ་མོའི་མ་མིག་མཛེས་ཤེས་བྱ་བ་འདི་ནི་དེའི་ཚེ་དེའི་དུས་ན་སྤྲུལ་འཚོང་མའི་གཙོ་མོ་བལྟ་ན་སྡུག་པ་ཞེས་བྱ་བར་གྱུར་ཏོ།
en: Do not think that it was anyone else, noble one, for at that time, in that time, my mother, Sunetrā, the wife of the Śākya Daṇḍapāṇi, was Sudarśanā, the preeminent courtesan.

source: དེའི་ཚེ་དེའི་དུས་ན་བུ་མོ་དགའ་བའི་འོད་ཀྱི་དཔལ་ཤིན་ཏུ་སྦྱངས་པ།
en: At that time, in that time, who was the girl Sucalita­rati­prabhāsa­śrī?

source: ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཞིག་ཡིན་བ་ཙམ་དུ་སེམས་ན་ནི་དེ་ལྟར་མི་བལྟ་སྟེ། ཁོ་མོ་ནི་དེའི་ཚེ་དེའི་དུས་ན། སྤྲུལ་འཚོང་མའི་བུ་མོ་དགའ་བའི་འོད་ཀྱི་དཔལ་ཤིན་ཏུ་སྦྱངས་པ་ཞེས་བྱ་བར་གྱུར་ཏོ།
en: Do not think that it was anyone else, noble one, for at that time, in that time, I was Sucalita­rati­prabhāsa­śrī, the daughter of the courtesan.

source: དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་གཟི་བརྗིད་ཀྱི་བདག་པོའི་འཁོར་དུ་གྱུར་པ་དེ་རྣམས་གཞན་ཞིག་ཡིན་པ་ཙམ་དུ་སེམས་ན་ནི།
en: At that time, in that time, who were the entourage of King Tejodhipati?

source: རིགས་ཀྱི་བུ་དེ་ནི་དེ་ལྟར་མི་བལྟ་སྟེ་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་དང་། སྨོན་ལམ་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་ལ་དགོད་དགོད་པའི་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་འདི་ཉིད་ན་འཁོད་ཅིང་།
en: Do not think that they were anyone else, noble one, for they are now those who are established in this very assembly of followers who are bodhisattvas established by the Bhagavat in the perfection of the completely good conduct and prayer of bodhisattvas;

source: འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་གཟུགས་བརྙན་རབ་ཏུ་བྱུང་བའི་ལུས་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་རྣམ་པར་སྤྱོད་པ་ལས་མཉམས་པའི་སེམས་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཞལ་མངོན་དུ་མཐོང་བར་རྣམ་པར་དམྱིགས་པའི་མིག་དང་དེ་བཞིན་མིག་དང་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་གསུང་གི་ཡན་ལག་གི་སྤྲིན་ནམ་མཁའ་དང་མཉམ་པའི་འཁོར་ལོ་རབ་ཏུ་བསྒྲགས་པའི་དབྱངས་རྣམ་པར་དམྱིགས་པའི་རྣ་བ་དང་། ཆོས་ཐམས་ཅད་ལ་རྣམ་པར་སྤྱད་པར་དབང་བསྒྱུར་བའི་དབུགས་ཕྱི་ནང་དུ་རྒྱུ་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་རྗེས་སུ་གྲགས་པའི་མིང་གི་སྒྲ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་དུ་ཉེ་བར་འགྲོ་བ་རྒྱུན་མི་གཅོད་པའི་བྱང་ཆུབ་སེམས་དཔའི་ལུས་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་མངོན་པར་སྟོན་པའི་ལུས་ཡོངས་སུ་སྨྱིན་བར་བྱ་བ་དང་། གདུལ་བ་ལ་རྗེས་སུ་མཐུན་པ་མངོན་པར་བསྒྲུབས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་དང་། སྨོན་ལམ་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་དང་། ཡང་དག་པར་བསྒྲུབས་པ་ཕྱོགས་ཀྱི་དྲ་བ་མ་ལུས་པ་ཐམས་ཅད་དུ་འདལ་ཏེ།
en: whose bodies appeared as images in all world realms; whose minds never lapse from the practice of all bodhisattva samādhis; whose eyes have the perception of directly seeing the faces of all tathāgatas; whose ears perceive the voices of the clouds of the aspects of the speech, as vast as space, of all the tathāgatas that resound with the wheel of the Dharma; whose inhalations and exhalations have power over the practice of all Dharmas; the sound of whose names resound throughout all the buddha realms; whose bodhisattva bodies go without interruption to the circles of the assemblies of all the tathāgatas; who create bodies that manifest to all beings, in accordance with their aspirations, in ways that are favorable for ripening and guidance;

source: མ་འོངས་པའི་བསྐལ་པ་ཐམས་ཅད་དུ་རྒྱུན་མི་འཆད་པ་དང་ལྡན་པ་ཤ་སྟག །བཅོམ་ལྡན་འདས་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་ན་འཁོད་པ་འདི་དག་ཡིན་ནོ།
en: and who, spreading throughout the entirety of the net of the directions, accomplish and perfect the completely good conduct and prayer continuously throughout all future kalpas and are present in the circle of the assembly of the Bhagavat.

source: །རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་སྐུ་ཉི་མ་དམ་པ་དེ་ནི་འཁོར་ལོས་སྒྱུར་བ་གཟི་བརྗིད་ཀྱི་བདག་པོ་དང་། ཁོ་མོས་ནམ་བཞུགས་ཀྱི་བར་དུ་ན་བཟའ་དང་བཤོས་དང་། གཟིམས་ཆ་དང་། སྙུན་གྱི་རྐྱེན་སྨན་དང་ཡོ་བྱད་ཀྱིས་བསྙེན་བཀུར་ཏོ།
en: “Noble one, the cakravartin Tejodhipati and I served the Tathāgata Sūrya­gātra­pravara for as long as he lived, with clothing, food, alms, bedding, medicine during times of illness, and necessary articles.

source: །རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་སྐུ་ཉི་མ་དམ་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་འོག་ཏུ་འཇིག་རྟེན་གྱི་ཁམས་དེ་ཉིད་དུ་དེ་བཞིན་གཤེགས་པ་སྐུ་ཤིན་ཏུ་དང་བ་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: “Noble one, after the parinirvāṇa of the Tathāgata Sūrya­gātra­pravara, in that world realm there appeared in the world the tathāgata named Prasannagātra.

source: དེ་ཡང་ཁོ་མོ་ཅག་གིས་བསྙེན་བཀུར་ཏོ། རིམ་གྲོར་བྱས་སོ། །བསྟི་སྟང་དུ་བྱས་སོ། །ཕུ་དུད་དུ་བྱས་སོ། །མཆོད་དོ།
en: We also served him, showed him respect, honored him, venerated him, and made offerings to him.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་སྐུ་ཐམས་ཅད་ལ་ཡེ་ཤེས་ཀྱི་གཟུགས་བརྙན་གྱི་ཟླ་བ་སྣང་བ་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ། དེ་ཡང་ཁོ་མོ་ཅིག་གིས་ལྷའི་དབང་པོར་གྱུར་ཏེ།
en: “Subsequently, we served the tathāgata named Jāmbū­nada­tejorāja who appeared in the world.

source: བསྙེན་བཀུར་ཏོ། །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་འཛམ་བུ་ཆུ་ཀླུང་གི་གཟི་བརྗིད་རྒྱལ་པོ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: “Subsequently, we served the tathāgata named Lakṣaṇa­bhūṣita­gātra who appeared in the world.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་སྐུ་མཚན་གྱིས་རྣམ་པར་བརྒྱན་པ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: “Subsequently, we served the tathāgata named Vicitra­raśmi­jvalana­candra who appeared in the world.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་འོད་གཟེར་སྣ་ཚོགས་འབར་བའི་ཟླ་བ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: “Subsequently, we served the tathāgata named Suvilokita­jñāna­ketu who appeared in the world.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཤིན་ཏུ་རྣམ་པར་གཟིགས་པའི་ཡེ་ཤེས་དཔལ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: “Subsequently, we served the tathāgata named Vipula­mahā­jñāna­raśmi­rāja who appeared in the world.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་ཆེན་པོའི་འོད་གཟེར་ཤིན་ཏུ་ཡངས་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་བསྟེན་བཀུར་ཏོ། །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་རྡོ་རྗེ་མཐུ་བོ་ཆེའོ་བརྩོན་འགྲུས་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: “Subsequently, we served the tathāgata named Nārāyaṇa­vajra­vīrya who appeared in the world.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་གཞན་གྱིས་མི་ཐུབ་པའི་མཐུ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ།
en: “Subsequently, we served the tathāgata named Aparājita­jñāna­sthāma who appeared in the world.
